
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>http · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="css.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前端知识点
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    兼容性问题
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../compatibility/mobile.html">
            
                <a href="../compatibility/mobile.html">
            
                    
                    移动端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../compatibility/pc.html">
            
                <a href="../compatibility/pc.html">
            
                    
                    pc端
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    设计模式
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../pattern/pattern.html">
            
                <a href="../pattern/pattern.html">
            
                    
                    工厂模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    面试题
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../exercise/algorithm.html">
            
                <a href="../exercise/algorithm.html">
            
                    
                    算法题
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    前端知识点
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="js.html">
            
                <a href="js.html">
            
                    
                    js
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="css.html">
            
                <a href="css.html">
            
                    
                    css
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5.3" data-path="http.html">
            
                <a href="http.html">
            
                    
                    http
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >http</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="&#x6D4F;&#x89C8;&#x5668;&#x8F93;&#x5165;url&#x5230;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x663E;&#x793A;&#x51FA;&#x6765;&#x7ECF;&#x5386;&#x7684;&#x8FC7;&#x7A0B;&#x3002;">&#x6D4F;&#x89C8;&#x5668;&#x8F93;&#x5165;url&#x5230;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x663E;&#x793A;&#x51FA;&#x6765;&#x7ECF;&#x5386;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</h3>
<pre><code>hosts&#x67E5;&#x8BE2;&#x6620;&#x5C04;&#x2014;&#x2014;&gt;DNS&#x89E3;&#x6790;&#x2014;&#x2014;&gt;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x2014;&#x2014;&gt;&#x53D1;&#x8D77;&#x8BF7;&#x6C42;&#x2014;&#x2014;&gt;&#x7B49;&#x5F85;&#x54CD;&#x5E94;&#x2014;&#x2014;&gt;&#x63A5;&#x53D7;&#x6570;&#x636E;&#x2014;&#x2014;&gt;&#x5904;&#x7406;&#x5143;&#x7D20;&#x2014;&#x2014;&gt;&#x5E03;&#x5C40;&#x6E32;&#x67D3;
http://blog.csdn.net/android1514/article/details/51281494
http://www.cnblogs.com/SarahLiu/p/5954832.html

&#x7B80;&#x5355;&#x63CF;&#x8FF0;&#xFF1A;
&#x67E5;&#x627E;&#x6D4F;&#x89C8;&#x5668;&#x7F13;&#x5B58;     DNS&#x89E3;&#x6790;&#x3001;&#x67E5;&#x627E;&#x8BE5;&#x57DF;&#x540D;&#x5BF9;&#x5E94;&#x7684;IP&#x5730;&#x5740;&#x3001;&#x91CD;&#x5B9A;&#x5411;&#xFF08;301&#xFF09;&#x3001;&#x53D1;&#x51FA;&#x7B2C;&#x4E8C;&#x4E2A;GET&#x8BF7;&#x6C42;    &#x8FDB;&#x884C;HTTP&#x534F;&#x8BAE;&#x4F1A;&#x8BDD;    &#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x62A5;&#x5934;(&#x8BF7;&#x6C42;&#x62A5;&#x5934;)    &#x670D;&#x52A1;&#x5668;&#x56DE;&#x9988;&#x62A5;&#x5934;(&#x54CD;&#x5E94;&#x62A5;&#x5934;)    html&#x6587;&#x6863;&#x5F00;&#x59CB;&#x4E0B;&#x8F7D;    &#x6587;&#x6863;&#x6811;&#x5EFA;&#x7ACB;&#xFF0C;&#x6839;&#x636E;&#x6807;&#x8BB0;&#x8BF7;&#x6C42;&#x6240;&#x9700;&#x6307;&#x5B9A;MIME&#x7C7B;&#x578B;&#x7684;&#x6587;&#x4EF6;    
&#x6587;&#x4EF6;&#x663E;&#x793A;  [&#x6D4F;&#x89C8;&#x5668;&#x8FD9;&#x8FB9;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x5927;&#x81F4;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x51E0;&#x6B65;&#xFF1A;    &#x52A0;&#x8F7D;&#xFF1A;&#x6839;&#x636E;&#x8BF7;&#x6C42;&#x7684;URL&#x8FDB;&#x884C;&#x57DF;&#x540D;&#x89E3;&#x6790;&#xFF0C;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x8D77;&#x8BF7;&#x6C42;&#xFF0C;&#x63A5;&#x6536;&#x6587;&#x4EF6;&#xFF08;HTML&#x3001;JS&#x3001;CSS&#x3001;&#x56FE;&#x8C61;&#x7B49;&#xFF09;&#x3002;    &#x89E3;&#x6790;&#xFF1A;&#x5BF9;&#x52A0;&#x8F7D;&#x5230;&#x7684;&#x8D44;&#x6E90;&#xFF08;HTML&#x3001;JS&#x3001;CSS&#x7B49;&#xFF09;&#x8FDB;&#x884C;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#xFF0C;&#x5EFA;&#x8BAE;&#x76F8;&#x5E94;&#x7684;&#x5185;&#x90E8;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x6BD4;&#x5982;HTML&#x7684;DOM&#x6811;&#xFF0C;JS&#x7684;&#xFF08;&#x5BF9;&#x8C61;&#xFF09;&#x5C5E;&#x6027;&#x8868;&#xFF0C;CSS&#x7684;&#x6837;&#x5F0F;&#x89C4;&#x5219;&#x7B49;&#x7B49;)}

&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#xFF1A; 
http&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;TCP&#x534F;&#x8BAE;&#x7684;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF0C;&#x5DE5;&#x4F5C;&#x5728;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x6709;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x3002;&#x6574;&#x4F53;&#x901A;&#x4FE1;&#xFF1A;
&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x521B;&#x5EFA;&#x8FDE;&#x63A5;
&#x57DF;&#x540D;&#x89E3;&#x6790;&#x5F97;&#x5230;&#x7F51;&#x7AD9;&#x7684;ip&#x5730;&#x5740;&#xFF0C;&#x7136;&#x540E;&#x5411;&#x8FD9;&#x4E2A;ip&#x5730;&#x5740;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x63A5;&#x6536;&#x5230;&#x8BF7;&#x6C42;&#x540E;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x786E;&#x8BA4;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5F97;&#x5230;&#x786E;&#x8BA4;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x786E;&#x8BA4;&#xFF0C;&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x6210;&#x529F;&#x3002;
&#x7B2C;&#x4E8C;&#x6B65;&#x670D;&#x52A1;&#x5668;&#x5904;&#x7406;
&#x5EFA;&#x7ACB;&#x597D;&#x8FDE;&#x63A5;&#x540E;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5C31;&#x4F1A;&#x53D1;&#x9001;http&#x8BF7;&#x6C42;&#xFF0C;&#x8BF7;&#x6C42;&#x4FE1;&#x606F;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5934;&#x90E8;&#x548C;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x4F53;&#xFF0C;&#x5728;&#x8BF7;&#x6C42;&#x5BF9;&#x8C61;&#x4E2D;&#x53EF;&#x4EE5;&#x5F97;&#x5230;path&#xFF08;&#x8DEF;&#x5F84;&#xFF09;&#xFF0C;queryString&#xFF08;&#x67E5;&#x8BE2;&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#xFF0C;body&#xFF08;post&#x8BF7;&#x6C42;&#x4E2D;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#xFF09;&#x7B49;&#x3002;
&#x6839;&#x636E;path&#x627E;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#x60F3;&#x8981;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x8BFB;&#x53D6;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x54CD;&#x5E94;&#x5BF9;&#x8C61;&#x628A;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x5934;&#x548C;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x4F53;&#x8FD4;&#x56DE;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x8BBE;&#x7F6E;&#x54CD;&#x5E94;&#x5934;&#x5C31;&#x662F;&#x8BBE;&#x7F6E;content-type&#x3002;
&#x8FD9;&#x4E2A;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x6709;&#x6570;&#x636E;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x9875;&#x9762;&#x7684;&#x6784;&#x5EFA;&#xFF0C;&#x8DEF;&#x5F84;&#x7684;&#x67E5;&#x627E;&#x5339;&#x914D;&#xFF0C;&#x6587;&#x4EF6;&#x7684;&#x8BFB;&#x53D6;&#x7B49;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x51FA;&#x73B0;&#x4E86;MVC&#x6846;&#x67B6;&#x4EE5;&#x53CA;&#x5404;&#x79CD;MV*&#x6846;&#x67B6;&#x3002;MVC&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x89E3;&#x8026;&#x548C;&#x6A21;&#x5757;&#x5316;&#x3002;&#x6211;&#x8BA4;&#x4E3A;MVC&#x5B9E;&#x73B0;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6709;&#x4E24;&#x70B9;&#xFF1A;
&#x8DEF;&#x7531;&#x5339;&#x914D;&#xFF0C;http&#x8BF7;&#x6C42;&#x7684;path&#x4E2D;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x5230;&#x5177;&#x4F53;&#x7684;&#x89C6;&#x56FE;&#x4F4D;&#x7F6E;&#xFF0C;&#x800C;&#x662F;&#x6309;&#x7167;&#x6211;&#x4EEC;&#x5236;&#x5B9A;&#x7684;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#x5339;&#x914D;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x6709;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x53EF;&#x7F16;&#x7A0B;&#x6027;&#x3002;
&#x6A21;&#x677F;&#x6280;&#x672F;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x6211;&#x4EEC;&#x6700;&#x540E;&#x8FD4;&#x56DE;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x662F;&#x4E00;&#x4E2A;html&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x800C;&#x6709;&#x65F6;&#x5019;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x9700;&#x8981;&#x548C;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7ED3;&#x5408;&#xFF0C;&#x9700;&#x8981;&#x62FC;&#x63A5;&#x3002;&#x6A21;&#x677F;&#x6280;&#x672F;&#x4E3A;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5E26;&#x6765;&#x5F88;&#x5927;&#x7684;&#x4FBF;&#x5229;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x53C8;&#x80FD;&#x591F;&#x628A;&#x89C6;&#x56FE;&#x548C;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x89E3;&#x8026;&#x3002;
    &#x7B2C;&#x4E09;&#x6B65;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x6E32;&#x67D3;
&#x5BA2;&#x6237;&#x7AEF;&#x63A5;&#x6536;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4F20;&#x6765;&#x7684;&#x54CD;&#x5E94;&#x5BF9;&#x8C61;&#xFF0C;&#x4ECE;&#x4E2D;&#x5F97;&#x5230;html&#x5B57;&#x7B26;&#x4E32;&#x548C;MIME&#xFF0C;&#x6839;&#x636E;MIME&#x77E5;&#x9053;&#x4E86;&#x8981;&#x7528;&#x9875;&#x9762;&#x6E32;&#x67D3;&#x5F15;&#x64CE;&#x6765;&#x5904;&#x7406;&#x5185;&#x5BB9;&#x5373;html&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4E8E;&#x662F;&#x8FDB;&#x5165;&#x9875;&#x9762;&#x6E32;&#x67D3;&#x9636;&#x6BB5;&#xFF1A;
&#x4ECE;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x89D2;&#x5EA6;&#x8BB2;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x51E0;&#x5927;&#x7EC4;&#x4EF6;&#xFF0C;&#x7F51;&#x7EDC;&#x529F;&#x80FD;&#xFF08;&#x6BD4;&#x5982;http&#x7684;&#x5B9E;&#x73B0;&#xFF09;&#xFF0C;&#x6E32;&#x67D3;&#x5F15;&#x64CE;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;UI&#x754C;&#x9762;&#xFF0C;javascript&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7B49;&#x3002;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x6E32;&#x67D3;&#x5F15;&#x64CE;&#x548C;javascript&#x89E3;&#x91CA;&#x5668;&#x3002;
&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x8C03;&#x7528;&#x5E95;&#x5C42;&#x7ED8;&#x56FE;API&#x7ED9;&#x753B;&#x51FA;&#x6765;&#x7684;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x6E32;&#x67D3;&#x5F15;&#x64CE;&#xFF0C;&#x5B83;&#x7684;&#x5B9E;&#x73B0;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x4E3B;&#x6D41;&#x7684;&#x5F15;&#x64CE;&#x5305;&#x62EC;IE&#x7684;Trident&#xFF0C;chrome&#x548C;safary&#x7684;webkit&#xFF0C;firefox&#x7684;Gecko&#xFF0C;chrome&#x53C8;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;Blink&#xFF0C;&#x653E;&#x5F03;webkit&#x3002;&#x6240;&#x4EE5;&#x624D;&#x6709;&#x4E86;&#x8BA9;&#x4EBA;&#x5934;&#x75BC;&#x7684;&#x5404;&#x79CD;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#x3002;
&#x6574;&#x4F53;&#x4E0A;&#x9875;&#x9762;&#x6E32;&#x67D3;&#x7684;&#x8FC7;&#x7A0B;&#x5927;&#x81F4;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;
&#x6E32;&#x67D3;&#x5F15;&#x64CE;&#x5F97;&#x5230;html&#x5B57;&#x7B26;&#x4E32;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x5BF9;html&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#xFF0C;&#x8F6C;&#x5316;&#x6210;&#x80FD;&#x591F;&#x88AB;DOM&#x5904;&#x7406;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x63A5;&#x7740;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E2A;dom&#x6811;&#xFF0C;&#x5728;&#x89E3;&#x6790;html&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x89E3;&#x6790;&#x5230;&lt;link&gt;,&lt;script&gt;,&lt;img&gt;&#x7B49;&#x4E00;&#x4E9B;&#x8BF7;&#x6C42;&#x6807;&#x7B7E;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x628A;&#x5BF9;&#x5E94;&#x7684;&#x5185;&#x5BB9;&#x83B7;&#x53D6;&#x5230;&#x3002;&#x8FD9;&#x65F6;&#x53C8;&#x4F1A;&#x540C;&#x6B65;&#x8FDB;&#x884C;css&#x7684;&#x89E3;&#x6790;&#xFF0C;&#x6784;&#x5EFA;&#x51FA;css&#x6837;&#x5F0F;&#x89C4;&#x5219;&#x5E94;&#x7528;&#x5230;dom&#x6811;&#x4E0A;&#xFF0C;
&#x7136;&#x540E;&#x8FDB;&#x884C;&#x4E00;&#x5B9A;&#x7684;&#x5E03;&#x5C40;&#x5904;&#x7406;&#xFF0C;&#x6BD4;&#x5982;&#x6807;&#x8BB0;&#x8282;&#x70B9;&#x5757;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7684;&#x5750;&#x6807;&#x7B49;&#x5F62;&#x6210;&#x6700;&#x7EC8;&#x7684;&#x6E32;&#x67D3;&#x6811;&#xFF0C;&#x6700;&#x540E;&#x6839;&#x636E;&#x8FD9;&#x68F5;&#x6E32;&#x67D3;&#x6811;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x7A97;&#x53E3;&#x4E2D;&#x8FDB;&#x884C;&#x7ED8;&#x5236;&#x3002;&#x6700;&#x7EC8;&#x6211;&#x4EEC;&#x5C31;&#x770B;&#x5230;&#x4E86;&#x9875;&#x9762;&#x7684;&#x6837;&#x5B50;&#x3002;
&#x5F53;&#x7136;&#x5728;&#x9875;&#x9762;&#x6E32;&#x67D3;&#x8FC7;&#x7A0B;&#x4E2D;&#x8FD8;&#x4F1A;&#x540C;&#x6B65;&#x8FDB;&#x884C;javascript&#x7684;&#x89E3;&#x6790;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E24;&#x8005;&#x662F;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x65E6;javascript&#x6B7B;&#x5FAA;&#x73AF;&#xFF0C;&#x9875;&#x9762;&#x7684;&#x6E32;&#x67D3;&#x4E5F;&#x5C31;&#x8FDB;&#x884C;&#x4E0D;&#x4E0B;&#x53BB;&#x4E86;&#x3002;
&#x4EE5;&#x4E0A;&#x662F;&#x6211;&#x4ECE;&#x4E00;&#x4E2A;web&#x5F00;&#x53D1;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x601D;&#x8003;&#x7684;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;&#x5982;&#x679C;&#x4ECE;&#x522B;&#x7684;&#x89D2;&#x5EA6;&#x66F4;&#x7EC6;&#x5316;&#x7684;&#x53BB;&#x60F3;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x6BD4;&#x5982;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x4E2D;&#x534F;&#x8BAE;&#x7684;&#x5C01;&#x88C5;&#xFF1A;
&#x5728;&#x672C;&#x673A;&#x4E2D;&#xFF0C;&#x628A;&#x8981;&#x4F20;&#x8F93;&#x7684;&#x5185;&#x5BB9;&#x5373;&#x8BF7;&#x6C42;&#x5BF9;&#x8C61;&#x5728;&#x5E94;&#x7528;&#x5C42;&#x4E0A;&#x52A0;&#x4E0A;App&#x9996;&#x90E8;&#xFF0C;&#x4F20;&#x9012;&#x5230;&#x4F20;&#x8F93;&#x5C42;&#x52A0;&#x4E0A;TCP&#x9996;&#x90E8;&#xFF0C;&#x5230;&#x7F51;&#x7EDC;&#x5C42;&#x52A0;&#x4E0A;IP&#x9996;&#x90E8;&#xFF0C;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x52A0;&#x4E0A;&#x4EE5;&#x592A;&#x7F51;&#x7684;&#x9996;&#x90E8;&#x548C;&#x5C3E;&#x90E8;&#xFF0C;&#x7136;&#x540E;&#x8F6C;&#x6362;&#x6210;bit&#x6D41;&#x8FDB;&#x5165;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x4E2D;&#x3002;&#x5230;&#x8FBE;&#x4E3B;&#x673A;&#x540E;&#x5728;&#x4E00;&#x5C42;&#x5C42;&#x89E3;&#x5C01;&#x88C5;&#xFF0C;&#x6700;&#x540E;&#x628A;&#x5185;&#x5BB9;&#x4EA4;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#x7A0B;&#x5E8F;&#x3002;
&#x518D;&#x6BD4;&#x5982;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x8BA4;&#x8BC1;&#xFF0C;&#x52A0;&#x5BC6;&#xFF0C;&#x5B89;&#x5168;&#xFF0C;&#x7F16;&#x7801;&#x7B49;&#x95EE;&#x9898;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x6211;&#x5C31;&#x4E0D;&#x662F;&#x5F88;&#x4E86;&#x89E3;&#x3002;
</code></pre><h3 id="http&#x72B6;&#x6001;&#x7801;">http&#x72B6;&#x6001;&#x7801;</h3>
<pre><code>301 (SC_MOVED_PERMANENTLY&#x6C38;&#x4E45;&#x91CD;&#x5B9A;&#x5411;),&#x72B6;&#x6001;&#x662F;&#x6307;&#x6240;&#x8BF7;&#x6C42;&#x7684;&#x6587;&#x6863;&#x5728;&#x522B;&#x7684;&#x5730;&#x65B9;&#xFF1B;&#x6587;&#x6863;&#x65B0;&#x7684;URL&#x4F1A;&#x5728;&#x5B9A;&#x4F4D;&#x54CD;&#x5E94;&#x5934;&#x4FE1;&#x606F;&#x4E2D;&#x7ED9;&#x51FA;&#x3002;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x81EA;&#x52A8;&#x8FDE;&#x63A5;&#x5230;&#x65B0;&#x7684;URL&#x3002;
302 (Found/&#x627E;&#x5230;&#xFF0C;&#x4E34;&#x65F6;&#x91CD;&#x5B9A;&#x5411;),&#x4E0E;301&#x6709;&#x4E9B;&#x7C7B;&#x4F3C;&#xFF0C;&#x53EA;&#x662F;&#x5B9A;&#x4F4D;&#x5934;&#x4FE1;&#x606F;&#x4E2D;&#x6240;&#x7ED9;&#x7684;URL&#x5E94;&#x88AB;&#x7406;&#x89E3;&#x4E3A;&#x4E34;&#x65F6;&#x4EA4;&#x6362;&#x5730;&#x5740;&#x800C;&#x4E0D;&#x662F;&#x6C38;&#x4E45;&#x7684; 
304 (Not Modified/&#x4E3A;&#x4FEE;&#x6B63;),&#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x6709;&#x4E00;&#x4E2A;&#x7F13;&#x5B58;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A; If-Modified-Since &#x5934;&#x4FE1;&#x606F;&#x53EF;&#x6307;&#x51FA;&#x5BA2;&#x6237;&#x7AEF;&#x53EA;&#x5E0C;&#x671B;&#x6587;&#x6863;&#x5728;&#x6307;&#x5B9A;&#x65E5;&#x671F;&#x4E4B;&#x540E;&#x6709;&#x6240;&#x4FEE;&#x6539;&#x65F6;&#x624D;&#x4F1A;&#x91CD;&#x8F7D;&#x6B64;&#x6587;&#x6863;&#xFF0C;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6709;&#x6761;&#x4EF6;&#x7684;&#x8BF7;&#x6C42;&#x3002;
400 (Bad Request/&#x9519;&#x8BEF;&#x8BF7;&#x6C42;),400 (SC_BAD_REQUEST)&#x6307;&#x51FA;&#x5BA2;&#x6237;&#x7AEF;&#x8BF7;&#x6C42;&#x4E2D;&#x7684;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x3002; 
401 (Unauthorized/&#x672A;&#x6388;&#x6743;),401 (SC_UNAUTHORIZED)&#x8868;&#x793A;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x6388;&#x6743;&#x5934;&#x4FE1;&#x606F;&#x4E2D;&#x6CA1;&#x6709;&#x6709;&#x6548;&#x7684;&#x8EAB;&#x4EFD;&#x4FE1;&#x606F;&#x65F6;&#x8BBF;&#x95EE;&#x53D7;&#x5230;&#x5BC6;&#x7801;&#x4FDD;&#x62A4;&#x7684;&#x9875;&#x9762;&#x3002;&#x8FD9;&#x4E2A;&#x54CD;&#x5E94;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x4E00;&#x4E2A;WWW-Authenticate&#x7684;&#x6388;&#x6743;&#x4FE1;&#x606F;&#x5934;.
403 (Forbidden/&#x7981;&#x6B62;),403 (SC_FORBIDDEN)&#x7684;&#x610F;&#x601D;&#x662F;&#x9664;&#x975E;&#x62E5;&#x6709;&#x6388;&#x6743;&#x5426;&#x5219;&#x670D;&#x52A1;&#x5668;&#x62D2;&#x7EDD;&#x63D0;&#x4F9B;&#x6240;&#x8BF7;&#x6C42;&#x7684;&#x8D44;&#x6E90;&#x3002;
405 (Method Not Allowed/&#x65B9;&#x6CD5;&#x672A;&#x5141;&#x8BB8;),405 (SC_METHOD_NOT_ALLOWED)&#x6307;&#x51FA;&#x8BF7;&#x6C42;&#x65B9;&#x6CD5;(GET, POST, HEAD, PUT, DELETE, &#x7B49;)&#x5BF9;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x8D44;&#x6E90;&#x4E0D;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x3002;
406 (Not Acceptable/&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;),406 (SC_NOT_ACCEPTABLE)&#x8868;&#x793A;&#x8BF7;&#x6C42;&#x8D44;&#x6E90;&#x7684;MIME&#x7C7B;&#x578B;&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x4E2D;Accept&#x5934;&#x4FE1;&#x606F;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x7C7B;&#x578B;&#x4E0D;&#x4E00;&#x81F4;&#x3002;
408 (Request Timeout/&#x8BF7;&#x6C42;&#x8D85;&#x65F6;),408 (SC_REQUEST_TIMEOUT)&#x662F;&#x6307;&#x670D;&#x52A1;&#x7AEF;&#x7B49;&#x5F85;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x7684;&#x65F6;&#x95F4;&#x8FC7;&#x957F;&#x3002;
410 (Gone/&#x5DF2;&#x7ECF;&#x4E0D;&#x5B58;&#x5728;),410 (SC_GONE)&#x544A;&#x8BC9;&#x5BA2;&#x6237;&#x7AEF;&#x6240;&#x8BF7;&#x6C42;&#x7684;&#x6587;&#x6863;&#x5DF2;&#x7ECF;&#x4E0D;&#x5B58;&#x5728;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#x7684;&#x5730;&#x5740;&#x3002;    
414 (Request URI Too Long/&#x8BF7;&#x6C42;URI&#x8FC7;&#x957F;),414 (SC_REQUEST_URI_TOO_LONG)&#x72B6;&#x6001;&#x7528;&#x4E8E;&#x5728;URI&#x8FC7;&#x957F;&#x7684;&#x60C5;&#x51B5;&#x65F6;&#x3002;&#x8FD9;&#x91CC;&#x6240;&#x6307;&#x7684;&#x201C;URI&#x201D;&#x662F;&#x6307;URL&#x4E2D;&#x4E3B;&#x673A;&#x3001;&#x57DF;&#x540D;&#x53CA;&#x7AEF;&#x53E3;&#x53F7;&#x4E4B;&#x540E;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x5728;URL--http://www.y2k-disaster.com:8080/we/look/silly/now/&#x4E2D;URI&#x662F;&#x6307;/we/look/silly/now/&#x3002;
415 (Unsupported Media Type/&#x4E0D;&#x652F;&#x6301;&#x7684;&#x5A92;&#x4F53;&#x683C;&#x5F0F;),415 (SC_UNSUPPORTED_MEDIA_TYPE)&#x610F;&#x5473;&#x7740;&#x8BF7;&#x6C42;&#x6240;&#x5E26;&#x7684;&#x9644;&#x4EF6;&#x7684;&#x683C;&#x5F0F;&#x7C7B;&#x578B;&#x670D;&#x52A1;&#x5668;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5904;&#x7406;&#x3002;
500 (Internal Server Error/&#x5185;&#x90E8;&#x670D;&#x52A1;&#x5668;&#x9519;&#x8BEF;),500 (SC_INTERNAL_SERVER_ERROR) &#x662F;&#x5E38;&#x7528;&#x7684;&#x201C;&#x670D;&#x52A1;&#x5668;&#x9519;&#x8BEF;&#x201D;&#x72B6;&#x6001;&#x3002;
501 (Not Implemented/&#x672A;&#x5B9E;&#x73B0;),501 (SC_NOT_IMPLEMENTED)&#x72B6;&#x6001;&#x544A;&#x8BC9;&#x5BA2;&#x6237;&#x7AEF;&#x670D;&#x52A1;&#x5668;&#x4E0D;&#x652F;&#x6301;&#x8BF7;&#x6C42;&#x4E2D;&#x8981;&#x6C42;&#x7684;&#x529F;&#x80FD;&#x3002;
502 (Bad Gateway/&#x9519;&#x8BEF;&#x7684;&#x7F51;&#x5173;),&#x88AB;&#x7528;&#x4E8E;&#x5145;&#x5F53;&#x4EE3;&#x7406;&#x6216;&#x7F51;&#x5173;&#x7684;&#x670D;&#x52A1;&#x5668;,&#x8BE5;&#x72B6;&#x6001;&#x6307;&#x51FA;&#x63A5;&#x6536;&#x670D;&#x52A1;&#x5668;&#x63A5;&#x6536;&#x5230;&#x8FDC;&#x7AEF;&#x670D;&#x52A1;&#x5668;&#x7684;&#x9519;&#x8BEF;&#x54CD;&#x5E94;&#x3002; 
503 (Service Unavailable/&#x670D;&#x52A1;&#x65E0;&#x6CD5;&#x83B7;&#x5F97;)&#x72B6;&#x6001;&#x7801;503 (SC_SERVICE_UNAVAILABLE)&#x8868;&#x793A;&#x670D;&#x52A1;&#x5668;&#x7531;&#x4E8E;&#x5728;&#x7EF4;&#x62A4;&#x6216;&#x5DF2;&#x7ECF;&#x8D85;&#x8F7D;&#x800C;&#x65E0;&#x6CD5;&#x54CD;&#x5E94;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4E9B;&#x7EBF;&#x7A0B;&#x6216;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x6C60;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x7A7A;&#x95F2;&#x5219;servlet&#x4F1A;&#x8FD4;&#x56DE;&#x8FD9;&#x4E2A;&#x5934;&#x4FE1;&#x606F;&#x3002;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;Retry-After&#x5934;&#x4FE1;&#x606F;&#x544A;&#x8BC9;&#x5BA2;&#x6237;&#x7AEF;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x5728;&#x8BD5;&#x4E00;&#x6B21;&#x3002;   
504 (Gateway Timeout/&#x7F51;&#x5173;&#x8D85;&#x65F6;)&#x8BE5;&#x72B6;&#x6001;&#x4E5F;&#x7528;&#x4E8E;&#x5145;&#x5F53;&#x4EE3;&#x7406;&#x6216;&#x7F51;&#x5173;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF1B;&#x5B83;&#x6307;&#x51FA;&#x63A5;&#x6536;&#x670D;&#x52A1;&#x5668;&#x6CA1;&#x6709;&#x4ECE;&#x8FDC;&#x7AEF;&#x670D;&#x52A1;&#x5668;&#x5F97;&#x5230;&#x53CA;&#x65F6;&#x7684;&#x54CD;&#x5E94;&#x3002;  
505 (HTTP Version Not Supported/&#x4E0D;&#x652F;&#x6301;&#x7684; HTTP &#x7248;&#x672C;),505 (SC_HTTP_VERSION_NOT_SUPPORTED)&#x72B6;&#x6001;&#x7801;&#x662F;&#x8BF4;&#x670D;&#x52A1;&#x5668;&#x5E76;&#x4E0D;&#x652F;&#x6301;&#x5728;&#x8BF7;&#x6C42;&#x4E2D;&#x6240;&#x6807;&#x660E; HTTP &#x7248;&#x672C;&#x3002;
</code></pre><h3 id="&#x6027;&#x80FD;&#x4F18;&#x5316;">&#x6027;&#x80FD;&#x4F18;&#x5316;</h3>
<pre><code>-.&#x9875;&#x9762;&#x67B6;&#x6784;&#x65B9;&#x9762;    
    1.&#x5C06;CSS&#x548C;JS&#x653E;&#x5230;&#x5916;&#x90E8;&#x6587;&#x4EF6;&#x4E2D;&#x5F15;&#x7528;&#xFF0C;CSS&#x653E;&#x5934;&#xFF0C;JS&#x653E;&#x5C3E;&#xFF0C;&#x7528;&lt;link&gt;&#x4EE3;&#x66FF;@import&#xFF0C;&#x56E0;&#x4E3A;@import&#x76F8;&#x5F53;&#x4E8E;&#x5C06;css&#x653E;&#x5728;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x5E95;&#x90E8;&#x3002;
    2.&#x5EF6;&#x8FDF;&#x52A0;&#x8F7D;&#xFF0C;&#x63D0;&#x9AD8;&#x9996;&#x5C4F;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;
    3.&#x4F18;&#x5316;&#x52A0;&#x8F7D;&#x65B9;&#x6848;&#xFF0C; &#x63D0;&#x524D;&#x52A0;&#x8F7D;&#xFF1A;&#x5F53;&#x524D;&#x7F51;&#x9875;&#x52A0;&#x8F7D;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x9A6C;&#x4E0A;&#x53BB;&#x4E0B;&#x8F7D;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x4F8B;&#x5982;google&#x4F1A;&#x5728;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x6210;&#x529F;&#x4E4B;&#x540E;&#x9A6C;&#x4E0A;&#x53BB;&#x4E0B;&#x8F7D;&#x4E00;&#x4E2A;&#x6240;&#x6709;&#x7ED3;&#x679C;&#x4E2D;&#x4F1A;&#x7528;&#x5230;&#x7684;image sprite&#x3002;&#x6309;&#x9700;&#x52A0;&#x8F7D;&#xFF1A;&#x6839;&#x636E;&#x7528;&#x6237;&#x7684;&#x8F93;&#x5165;&#x63A8;&#x65AD;&#x9700;&#x8981;&#x52A0;&#x8F7D;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x9884;&#x52A0;&#x8F7D;&#xFF1A;&#x6BD4;&#x5982;&#x8F6E;&#x64AD;&#x56FE;&#x52A0;&#x8F7D;&#x5DE6;&#x53F3;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#x3002;
-. &#x7F13;&#x5B58;&#x65B9;&#x9762;
    4.&#x6839;&#x636E;&#x57DF;&#x540D;&#x5212;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x9759;&#x6001;&#x5185;&#x5BB9;&#x548C;&#x52A8;&#x6001;&#x5185;&#x5BB9;&#x975E;&#x522B;&#x653E;&#x5728;&#x4E0D;&#x540C;&#x7684;domain&#x4E0B;&#xFF0C;&#x9759;&#x6001;&#x57DF;&#x53EF;&#x907F;&#x514D;&#x4F7F;&#x7528;cookie&#xFF0C;&#x51CF;&#x5C11;cookie&#x5927;&#x5C0F;&#xFF0C;&#x5229;&#x4E8E;&#x7F13;&#x5B58;&#x548C;proxy&#x7F13;&#x5B58;&#xFF08;&#x6709;&#x4E9B;proxy&#x62D2;&#x7EDD;&#x7F13;&#x5B58;cookie&#xFF09;&#xFF0C;&#x4F46;&#x57DF;&#x4E0D;&#x53EF;&#x592A;&#x591A;&#xFF0C;2~4&#x4E2A;&#x5408;&#x9002;&#xFF0C;&#x4E0D;&#x7136;&#x589E;&#x52A0;DNS&#x67E5;&#x8BE2;&#x65F6;&#x95F4;
    5.&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;Expires &#x6216;Cache-Control&#x62A5;&#x6587;&#x5934;&#x6765;&#x5229;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x7F13;&#x5B58;
-.&#x8BF7;&#x6C42;&#x65B9;&#x9762;
    6.&#x51CF;&#x5C11;HTTP&#x8BF7;&#x6C42;&#xFF0C;&#x53CA;&#x56FE;&#x7247;&#x4F18;&#x5316;&#x5904;&#x7406;
        &#x6587;&#x4EF6;&#x6253;&#x5305;&#xFF0C;&#x56FE;&#x7247;&#x5408;&#x5E76;&#xFF0C;&#x56FE;&#x7247;&#x61D2;&#x52A0;&#x8F7D;&#xFF0C;&#x4F7F;&#x7528;&#x96EA;&#x78A7;&#x56FE;&#x6216;&#x8005;base64&#xFF0C;&#x907F;&#x514D;&#x5728;HTML&#x4E2D;&#x7F29;&#x653E;&#x56FE;&#x7247;
    7.&#x51CF;&#x5C11;DNS&#x67E5;&#x8BE2;
        &#x5982;&#x679C;&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x6765;&#x81EA;&#x5404;&#x4E2A;&#x4E0D;&#x540C;&#x7684;domain (&#x6BD4;&#x5982;&#x5D4C;&#x5165;&#x4E86;&#x5F00;&#x653E;&#x5E7F;&#x544A;&#xFF0C;&#x5F15;&#x7528;&#x4E86;&#x5916;&#x90E8;&#x56FE;&#x7247;&#x6216;&#x811A;&#x672C;)&#xFF0C;&#x90A3;&#x4E48;&#x5BA2;&#x6237;&#x7AEF;&#x9996;&#x6B21;&#x89E3;&#x6790;&#x8FD9;&#x4E9B;domain&#x4E5F;&#x9700;&#x8981;&#x6D88;&#x8017;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x3002;
    8.&#x4F7F;&#x7528;CDN&#xFF0C;&#x901A;&#x8FC7;DNS&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5224;&#x65AD;&#x7528;&#x6237;&#x6765;&#x6E90;&#x5C31;&#x8FD1;&#x8BBF;&#x95EE;cache&#x670D;&#x52A1;&#x5668;&#x53D6;&#x5F97;&#x6240;&#x9700;&#x7684;&#x5185;&#x5BB9;
    9.&#x4E0A;&#x7EBF;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#xFF0C;Gzip&#x538B;&#x7F29;HTTP&#x8BF7;&#x6C42;,Gzip&#x7684;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x628A;&#x6587;&#x4EF6;&#x5148;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8FDB;&#x884C;&#x538B;&#x7F29;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4F20;&#x8F93;(&#x4E00;&#x822C;&#x538B;&#x7F29;&#x7387;&#x4E3A;85%).
    10.&#x907F;&#x514D;&#x91CD;&#x5B9A;&#x5411;&#xFF0C;404&#xFF0C;&#x7A7A;&#x7684;img src&#xFF0C;&#x907F;&#x514D;&#x65E0;&#x6548;&#x8BF7;&#x6C42;    
-.&#x4EE3;&#x7801;&#x65B9;&#x9762;
    11.&#x51CF;&#x5C11;DOM&#x5143;&#x7D20;&#x6570;&#x91CF;&#xFF0C;&#x907F;&#x514D;&#x9891;&#x7E41;DOM&#x8BBF;&#x95EE;&#xFF0C;&#x591A;&#x6B21;&#x8BBF;&#x95EE;&#x65F6;&#x91C7;&#x53D6;&#x53D8;&#x91CF;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#xFF0C;&#x51CF;&#x5C11;Reflow&#x548C;Repaint
    12.&#x51CF;&#x5C11;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x67E5;&#x627E;&#xFF0C;&#x51CF;&#x5C11;&#x95ED;&#x5305;&#xFF0C;&#x4F18;&#x5316;&#x5FAA;&#x73AF;&#x548C;&#x9012;&#x5F52;&#x7B97;&#x6CD5;&#xFF0C;&#x907F;&#x514D;&#x5185;&#x5B58;&#x6CC4;&#x9732;
    13.&#x4E8B;&#x4EF6;&#x59D4;&#x6258;
    14.&#x907F;&#x514D;&#x91CD;&#x5B9A;&#x5411;
    15.&#x5408;&#x7406;&#x5229;&#x7528;css&#x9009;&#x62E9;&#x5668;&#x5339;&#x914D;&#x89C4;&#x5219;&#xFF0C;&#x56E0;&#x5927;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x4E2A;DOM&#x6811;&#x4E2D;&#xFF0C;&#x7B26;&#x5408;&#x5339;&#x914D;&#x6761;&#x4EF6;&#x7684;&#x8282;&#x70B9;&#xFF08;&#x5982;.mod-nav h3 span&#xFF09;&#x8FDC;&#x8FDC;&#x8FDC;&#x8FDC;&#x5C11;&#x4E8E;&#x4E0D;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#x7684;&#x8282;&#x70B9;&#xFF0C;CSS&#x9009;&#x62E9;&#x5668;&#x7684;&#x8BFB;&#x53D6;&#x987A;&#x5E8F;&#x662F;&#x4ECE;&#x53F3;&#x5411;&#x5DE6;&#x66F4;&#x52A0;&#x9AD8;&#x6548;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x540E;&#x7684;&#x9009;&#x62E9;&#x5668;&#x66F4;&#x7CBE;&#x786E;&#x5339;&#x914D;&#x67E5;&#x627E;&#x66F4;&#x9AD8;&#x6548;
-. &#x79FB;&#x52A8;&#x7AEF;&#x65B9;&#x9762;
    16.&#x79FB;&#x52A8;&#x7AEF;&#x5355;&#x4E2A;&#x6587;&#x4EF6;&#x89E3;&#x538B;&#x540E;&#x5927;&#x5C0F;&#x63A7;&#x5236;&#x5728;25k&#x5DE6;&#x53F3;&#xFF0C;&#x56E0;&#x4E3A;iphone&#xFF0C;&#x4ED6;&#x53EA;&#x80FD;&#x7F13;&#x5B58;&#x5C0F;&#x4E8E;25K&#xFF0C;&#x6CE8;&#x610F;&#x8FD9;&#x662F;&#x89E3;&#x538B;&#x540E;&#x7684;&#x5927;&#x5C0F;&#x3002;
</code></pre><h3 id="&#x9875;&#x9762;&#x6E32;&#x67D3;&#x8FC7;&#x7A0B;">&#x9875;&#x9762;&#x6E32;&#x67D3;&#x8FC7;&#x7A0B;</h3>
<pre><code>1.HTML&#x4EE3;&#x7801;&#x8F6C;&#x5316;&#x6210;DOM
2.CSS&#x4EE3;&#x7801;&#x8F6C;&#x5316;&#x6210;CSSOM&#xFF08;CSS Object Model&#xFF09;
3.&#x7ED3;&#x5408;DOM&#x548C;CSSOM&#xFF0C;&#x751F;&#x6210;&#x4E00;&#x68F5;&#x6E32;&#x67D3;&#x6811;&#xFF08;&#x5305;&#x542B;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x89C6;&#x89C9;&#x4FE1;&#x606F;&#xFF09;
4.&#x751F;&#x6210;&#x5E03;&#x5C40;&#xFF08;layout&#xFF09;&#xFF0C;&#x5373;&#x5C06;&#x6240;&#x6709;&#x6E32;&#x67D3;&#x6811;&#x7684;&#x6240;&#x6709;&#x8282;&#x70B9;&#x8FDB;&#x884C;&#x5E73;&#x9762;&#x5408;&#x6210;&#xFF08; &#x53EF;&#x5F15;&#x8D77;&#x91CD;&#x6392;&#xFF09;
5.&#x5C06;&#x5E03;&#x5C40;&#x7ED8;&#x5236;&#xFF08;paint&#xFF09;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#xFF08;&#x53EF;&#x5F15;&#x8D77;&#x91CD;&#x7ED8;&#xFF09;&#x3002;
&quot;&#x751F;&#x6210;&#x5E03;&#x5C40;&quot;&#xFF08;flow&#xFF09;&#x548C;&quot;&#x7ED8;&#x5236;&quot;&#xFF08;paint&#xFF09;&#x8FD9;&#x4E24;&#x6B65;&#xFF0C;&#x5408;&#x79F0;&#x4E3A;&quot;&#x6E32;&#x67D3;&quot;&#xFF08;render&#xFF09;&#x3002;
</code></pre><h3 id="&#x51CF;&#x5C11;&#x91CD;&#x6392;&#x91CD;&#x7ED8;&#x6280;&#x5DE7;">&#x51CF;&#x5C11;&#x91CD;&#x6392;&#x91CD;&#x7ED8;&#x6280;&#x5DE7;</h3>
<pre><code>1.DOM &#x7684;&#x591A;&#x4E2A;&#x8BFB;&#x64CD;&#x4F5C;&#xFF08;&#x6216;&#x591A;&#x4E2A;&#x5199;&#x64CD;&#x4F5C;&#xFF09;&#xFF0C;&#x5E94;&#x8BE5;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x4E0D;&#x8981;&#x4E24;&#x4E2A;&#x8BFB;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#xFF0C;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x5199;&#x64CD;&#x4F5C;&#x3002;
2.&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x6837;&#x5F0F;&#x662F;&#x901A;&#x8FC7;&#x91CD;&#x6392;&#x5F97;&#x5230;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x597D;&#x7F13;&#x5B58;&#x7ED3;&#x679C;&#x3002;&#x907F;&#x514D;&#x4E0B;&#x4E00;&#x6B21;&#x7528;&#x5230;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x53C8;&#x8981;&#x91CD;&#x6392;&#x3002;
3.&#x4E0D;&#x8981;&#x4E00;&#x6761;&#x6761;&#x5730;&#x6539;&#x53D8;&#x6837;&#x5F0F;&#xFF0C;&#x800C;&#x8981;&#x901A;&#x8FC7;&#x6539;&#x53D8;class&#xFF0C;&#x6216;&#x8005;csstext&#x5C5E;&#x6027;&#xFF0C;&#x4E00;&#x6B21;&#x6027;&#x5730;&#x6539;&#x53D8;&#x6837;&#x5F0F;&#x3002;
4.&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x79BB;&#x7EBF;DOM&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x7F51;&#x9762;DOM&#xFF0C;&#x6765;&#x6539;&#x53D8;&#x5143;&#x7D20;&#x6837;&#x5F0F;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x64CD;&#x4F5C;Document Fragment&#x5BF9;&#x8C61;&#xFF0C;&#x5B8C;&#x6210;&#x540E;&#x518D;&#x628A;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x52A0;&#x5165;DOM&#x3002;&#x518D;&#x6BD4;&#x5982;&#xFF0C;&#x4F7F;&#x7528; cloneNode() &#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x514B;&#x9686;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7528;&#x514B;&#x9686;&#x7684;&#x8282;&#x70B9;&#x66FF;&#x6362;&#x539F;&#x59CB;&#x8282;&#x70B9;&#x3002;
5.&#x5148;&#x5C06;&#x5143;&#x7D20;&#x8BBE;&#x4E3A;display: none&#xFF08;&#x9700;&#x8981;1&#x6B21;&#x91CD;&#x6392;&#x548C;&#x91CD;&#x7ED8;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x8FD9;&#x4E2A;&#x8282;&#x70B9;&#x8FDB;&#x884C;100&#x6B21;&#x64CD;&#x4F5C;&#xFF0C;&#x6700;&#x540E;&#x518D;&#x6062;&#x590D;&#x663E;&#x793A;&#xFF08;&#x9700;&#x8981;1&#x6B21;&#x91CD;&#x6392;&#x548C;&#x91CD;&#x7ED8;&#xFF09;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x4F60;&#x5C31;&#x7528;&#x4E24;&#x6B21;&#x91CD;&#x65B0;&#x6E32;&#x67D3;&#xFF0C;&#x53D6;&#x4EE3;&#x4E86;&#x53EF;&#x80FD;&#x9AD8;&#x8FBE;100&#x6B21;&#x7684;&#x91CD;&#x65B0;&#x6E32;&#x67D3;&#x3002;
6.position&#x5C5E;&#x6027;&#x4E3A;absolute&#x6216;fixed&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x91CD;&#x6392;&#x7684;&#x5F00;&#x9500;&#x4F1A;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x7528;&#x8003;&#x8651;&#x5B83;&#x5BF9;&#x5176;&#x4ED6;&#x5143;&#x7D20;&#x7684;&#x5F71;&#x54CD;&#x3002;
7.&#x53EA;&#x5728;&#x5FC5;&#x8981;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x5C06;&#x5143;&#x7D20;&#x7684;display&#x5C5E;&#x6027;&#x4E3A;&#x53EF;&#x89C1;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x5143;&#x7D20;&#x4E0D;&#x5F71;&#x54CD;&#x91CD;&#x6392;&#x548C;&#x91CD;&#x7ED8;&#x3002;&#x53E6;&#x5916;&#xFF0C;visibility : hidden&#x7684;&#x5143;&#x7D20;&#x53EA;&#x5BF9;&#x91CD;&#x7ED8;&#x6709;&#x5F71;&#x54CD;&#xFF0C;&#x4E0D;&#x5F71;&#x54CD;&#x91CD;&#x6392;&#x3002;
8.&#x4F7F;&#x7528;&#x865A;&#x62DF;DOM&#x7684;&#x811A;&#x672C;&#x5E93;&#xFF0C;&#x6BD4;&#x5982;React&#x7B49;&#x3002;
9.&#x4F7F;&#x7528; window.requestAnimationFrame()&#x3001;window.requestIdleCallback() &#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x8C03;&#x8282;&#x91CD;&#x65B0;&#x6E32;&#x67D3;,requestAnimationFrame&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x5E27;&#x505A;&#x597D;&#x6240;&#x6709;&#x7684;&#x8BFB;&#x64CD;&#x4F5C;, &#x4E0B;&#x4E00;&#x5E27;&#x7EDF;&#x4E00;&#x505A;&#x5199;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;requestIdleCallback&#x53EA;&#x6709;&#x5F53;&#x524D;&#x5E27;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x5C0F;&#x4E8E;16.66ms&#x65F6;(&#x5982;&#x679C;&#x7F51;&#x9875;&#x52A8;&#x753B;&#x80FD;&#x591F;&#x505A;&#x5230;&#x6BCF;&#x79D2;60&#x5E27;&#xFF0C;
&#x5C31;&#x4F1A;&#x8DDF;&#x663E;&#x793A;&#x5668;&#x540C;&#x6B65;&#x5237;&#x65B0;&#xFF0C;&#x8FBE;&#x5230;&#x6700;&#x4F73;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x4E00;&#x79D2;&#x4E4B;&#x5185;&#x8FDB;&#x884C;60&#x6B21;&#x91CD;&#x65B0;&#x6E32;&#x67D3;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x6B21;&#x91CD;&#x65B0;&#x6E32;&#x67D3;&#x7684;&#x65F6;&#x95F4;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7;16.66&#x6BEB;&#x79D2;)&#xFF0C;&#x51FD;&#x6570;fn&#x624D;&#x4F1A;&#x6267;&#x884C;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x5C31;&#x63A8;&#x8FDF;&#x5230;&#x4E0B;&#x4E00;&#x5E27;&#xFF0C;&#x5982;&#x679C;&#x4E0B;&#x4E00;&#x5E27;&#x4E5F;&#x6CA1;&#x6709;&#x7A7A;&#x95F2;&#x65F6;&#x95F4;&#xFF0C;&#x5B83;&#x8FD8;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x8868;&#x793A;&#x6307;&#x5B9A;&#x7684;&#x6BEB;&#x79D2;&#x6570;&#x3002;&#x5982;&#x679C;&#x5728;&#x6307;&#x5B9A; &#x7684;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x4E4B;&#x5185;&#xFF0C;&#x6BCF;&#x4E00;&#x5E27;&#x90FD;&#x6CA1;&#x6709;&#x7A7A;&#x95F2;&#x65F6;&#x95F4;&#xFF0C;
&#x90A3;&#x4E48;&#x51FD;&#x6570;fn&#x5C06;&#x4F1A;&#x5F3A;&#x5236;&#x6267;&#x884C;&#x3002;&#x5C31;&#x63A8;&#x8FDF;&#x5230;&#x4E0B;&#x4E0B;&#x4E00;&#x5E27;&#x6216;&#x8005;&#x7528;&#x5BF9;&#x4EE5;&#x4E0A;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x5C01;&#x88C5;&#x63D2;&#x4EF6;fastdom&#x3002;   
</code></pre>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="css.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: css">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"http","level":"1.5.3","depth":2,"previous":{"title":"css","level":"1.5.2","depth":2,"path":"topic/css.md","ref":"topic/css.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"topic/http.md","mtime":"2017-11-28T06:29:13.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2017-11-28T07:03:23.884Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

